{
  "backend/main.mo": "Defines core domain types for routines, scoring, user profiles, utilities, and body composition used across the backend canister.",
  "feature_evidence.json": "Lists feature evidence reports linking feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference in build planning.",
  "frontend/index.html": "Base HTML file bootstrapping the React application via main.tsx.",
  "frontend/src/App.tsx": "Main app logic handling authentication flow, routing, error fallback, legal disclaimer checks, and dashboard redirects.",
  "frontend/src/components/AutophagyScoreInfo.tsx": "Modal dialog explaining Autophagy Score components with bilingual labels, icons, ranges, and progress details.",
  "frontend/src/components/BodyCompositionCard.tsx": "Body composition input card showing weight, body fat, muscle mass, BMI display, and presets with German/English labels.",
  "frontend/src/components/ChecklistCard.tsx": "Renders a card with a list of checklist items, each having a checkbox, label, and optional description, and handles toggle events.",
  "frontend/src/components/ChipsInput.tsx": "Displays a row of preset buttons that trigger a selection callback when clicked, with optional disabled and styling props.",
  "frontend/src/components/ChronographDial.tsx": "Implements an interactive circular dial using canvas to adjust a numeric value via angle-based dragging with gradients and tick marks.",
  "frontend/src/components/DailyCoachingCard.tsx": "Shows daily coaching steps and insights with category styling, icons, and multilingual support in a decorative card layout.",
  "frontend/src/components/EnergyCapsule.tsx": "Visual capsule wrapper that displays content with a fill level based on completion percentage and optional accent modes.",
  "frontend/src/components/FastingTimer.tsx": "Provides a fasting-duration selector using a ChronographDial and displays guidance text based on selected hours.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying a copyright notice and link with decorative styling.",
  "frontend/src/components/FutureProjectionSection.tsx": "Displays future health projections with trend icons and values across biological age, body form, and energy/focus.",
  "frontend/src/components/GradientSlider.tsx": "A customizable slider with gradient track, optional scale labels, and dynamic gradient generation from color stops.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation menu, token balance display, settings dialog, and logout handling.",
  "frontend/src/components/JournalCard.tsx": "Journal UI allowing creation, editing, deletion, and viewing of timestamped entries with bilingual messages.",
  "frontend/src/components/LegalDisclaimerModal.tsx": "Modal presenting bilingual legal disclaimers with acknowledgment tracking and first‑launch enforcement.",
  "frontend/src/components/LoginScreen.tsx": "Login screen using Internet Identity with branding, loading state, and feature icons.",
  "frontend/src/components/NutritionCard.tsx": "Card to track protein, vegetable, and water intake with stepper controls and preset chips in two languages.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form collecting user details and saving them via backend mutation with basic validation.",
  "frontend/src/components/RouterErrorFallback.tsx": "Displays an error fallback screen, logs router errors, and provides a reload button.",
  "frontend/src/components/ScoreRing.tsx": "Renders a canvas-based circular score indicator with gradient arc and optional label/value.",
  "frontend/src/components/SettingsDialog.tsx": "Provides a profile settings dialog that loads user data, allows edits, validates fields, and saves updates.",
  "frontend/src/components/SleepCard.tsx": "Shows sleep duration and quality controls using a stepper and dial with dynamic quality labels.",
  "frontend/src/components/SmartInsight.tsx": "Displays a small insight card with an icon based on type and a message.",
  "frontend/src/components/SmartInsightsOverlay.tsx": "Shows temporary insight overlays for high or low scores with themed icons and messages.",
  "frontend/src/components/StepperInput.tsx": "Numeric stepper with hold-to-accelerate functionality for incrementing or decrementing values.",
  "frontend/src/components/StressCard.tsx": "Tracks blood pressure and pulse values with steppers and computes a color‑coded stress indicator.",
  "frontend/src/components/SupplementCard.tsx": "Component for listing, adding, editing, deleting, and toggling supplements with form state and time‑based sorting.",
  "frontend/src/components/TokenWallet.tsx": "Displays token balance, transactions, supply info, admin tools, and supports on‑chain transfers with identity integration.",
  "frontend/src/components/TrainingCard.tsx": "Manages training sessions including adding, removing, and saving workouts with type, duration, and intensity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, state handling, and restores identities via an authentication context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profile, routines, supplements, token data, and scores via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive custom theme variables plus utility classes for a luxury gold/dark UI aesthetic.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/AnalysisPage.tsx": "Fetches routines and body data, computes statistics, renders charts, and provides analysis reset functionality with localization.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard managing user routines, body metrics, supplements, coaching, and UI cards with multiple backend mutations.",
  "frontend/src/pages/JournalPage.tsx": "Implements a journal with creation, editing, deletion, and localization, managing entry state and timestamps.",
  "frontend/src/pages/WalletPage.tsx": "Displays the LIV token wallet with language-specific text and ecosystem features plus the TokenWallet component.",
  "frontend/src/utils/backendVariants.ts": "Provides runtime-safe helpers for interpreting backend variant enums and computing intensity and body fat defaults.",
  "frontend/src/utils/dailyCoaching.ts": "Generates prioritized daily coaching steps based on user routines and health scores. Includes logic for sleep, hydration, fasting, training, nutrition, and stress.",
  "frontend/src/utils/dailyCoachingInsights.ts": "Creates up to three coaching insights using current metrics and optional health trends. Provides warnings, tips, praise, and trend-based messages.",
  "frontend/src/utils/theme.ts": "Defines gold/jade gradient theme utilities and helper functions for score-based colors and gradients. Includes tools for creating CSS gradient strings.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL parameters with sessionStorage fallback. Supports both query and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended color palette, gradients, shadows, and layout utilities using OKLCH variables. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, known issues, and feature requests related to app load errors, logo removal, and post-login routing changes."
}