{
  "backend/main.mo": "Defines the backend actor with all core domain types for routines, scoring, profiles, body composition, utilities, and tokens.",
  "feature_evidence.json": "Lists feature-evidence mappings detailing which frontend files implement specific UI redesign and interaction features.",
  "frontend-file-summaries.txt": "Provides short descriptions of numerous frontend files for documentation and build planning.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Top-level React app handling auth, profile setup, routing, theme, and legal disclaimer flow.",
  "frontend/src/components/AutophagyScoreInfo.tsx": "Dialog component explaining Autophagy Score breakdown with icons, progress indicators, and multilingual ranges.",
  "frontend/src/components/BodyCompositionCard.tsx": "Displays weight, body fat, muscle mass, and BMI with color-coded indicators and preset adjustment chips.",
  "frontend/src/components/ChecklistCard.tsx": "Renders a checklist card with toggleable items, optional descriptions, and an icon header.",
  "frontend/src/components/ChipsInput.tsx": "Provides clickable preset buttons for adjusting numeric values.",
  "frontend/src/components/ChronographDial.tsx": "Canvas-based circular dial that visualizes and adjusts a numeric value using gradient coloring and drag interaction.",
  "frontend/src/components/DailyCoachingCard.tsx": "Shows daily coaching steps and insights with category styling and icons.",
  "frontend/src/components/EnergyCapsule.tsx": "Visual capsule that fills based on completion percentage and optionally adds a glow effect.",
  "frontend/src/components/FastingTimer.tsx": "Fasting duration selector using a chronograph dial with color gradients and feedback text.",
  "frontend/src/components/Footer.tsx": "Simple footer with branding, year, and a link to caffeine.ai.",
  "frontend/src/components/FutureProjectionSection.tsx": "Presents biological age, body form, and energy projections with trend icons and descriptions.",
  "frontend/src/components/GradientSlider.tsx": "A customizable slider with a dynamic gradient track, optional scale labels, and value change handling.",
  "frontend/src/components/Header.tsx": "The app header providing navigation, token balance display, settings access, and logout handling with a mobile sidebar menu.",
  "frontend/src/components/JournalCard.tsx": "Displays and manages journal entries with create, edit, delete, and sorting functionality, supporting German and English labels.",
  "frontend/src/components/LegalDisclaimerModal.tsx": "A modal showing a bilingual legal disclaimer with acknowledgment logic, especially on first launch.",
  "frontend/src/components/LoginScreen.tsx": "Login screen using Internet Identity with branding, loading state, and feature icons.",
  "frontend/src/components/NutritionCard.tsx": "Tracks protein, vegetable, and water intake with stepper inputs and preset chips, supporting German/English labels.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a profile setup form that collects user info, validates inputs, and saves the profile via a mutation hook.",
  "frontend/src/components/ScoreRing.tsx": "Displays an animated score ring with dynamic colors, gradients, and optional trend sparkline visualization.",
  "frontend/src/components/SettingsDialog.tsx": "Provides a dialog for editing and saving user profile settings, prefilled from the stored profile.",
  "frontend/src/components/SleepCard.tsx": "Shows sleep duration and quality controls using a stepper and dial with labels and color gradients.",
  "frontend/src/components/SmartInsight.tsx": "Displays a small insight card with an icon and message based on the insight type.",
  "frontend/src/components/SmartInsightsOverlay.tsx": "Shows temporary motivational or warning messages based on score thresholds with animated overlay styling.",
  "frontend/src/components/StepperInput.tsx": "Implements a numeric stepper with click-and-hold acceleration for incrementing and decrementing values.",
  "frontend/src/components/StressCard.tsx": "Renders a stress‑tracking card with inputs for systolic, diastolic, and pulse, computing a color‑coded status indicator. Supports German/English labels and displays status severity based on vital ranges.",
  "frontend/src/components/SupplementCard.tsx": "Manages supplement entries with add, edit, delete, sort, and completion‑tracking features. Uses local form state and backend callbacks to persist and update supplement data.",
  "frontend/src/components/TokenWallet.tsx": "Displays token balance, transactions, rewards, and admin tools, with transfer and address‑copy functionality. Integrates multiple queries, identity handling, and UI tabs for wallet operations.",
  "frontend/src/components/TrainingCard.tsx": "Allows adding, listing, removing, and saving training sessions with type, duration, and intensity fields. Supports German/English labels and triggers optional load/save/clear actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, reinitializing on identity changes. Invalidates and refetches dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context with login, logout, identity persistence, and status tracking. Wraps AuthClient setup and exposes identity to consuming components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping actor calls for user profiles, routines, tokens, supplements, trainings, and analytics.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, and custom luxury-style utility classes for UI effects.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/AnalysisPage.tsx": "Displays charts and aggregated statistics from daily routines and body composition, with an option to reset analysis data.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing fasting, sleep, stress, training, nutrition, supplements, and scoring with extensive state and mutation handling.",
  "frontend/src/pages/JournalPage.tsx": "Provides CRUD functionality for personal journal entries with language-aware UI and timestamp formatting.",
  "frontend/src/pages/WalletPage.tsx": "Shows the LIV token wallet UI with blockchain-related info and localized descriptions.",
  "frontend/src/utils/dailyCoaching.ts": "Generates prioritized daily coaching steps based on routine metrics and health scores. Adds actionable recommendations for sleep, hydration, fasting, training, nutrition, and stress.",
  "frontend/src/utils/dailyCoachingInsights.ts": "Produces up to three coaching insights using current metrics and trends. Includes warnings, tips, praise, and trend-based feedback.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, and layout settings. Adds custom themes, plugins, and UI tokens for the app's design system.",
  "project_state.json": "Describes the project state and requirements for replacing slider-based routine inputs with modern dashboard-aligned UI controls. Lists existing features, new requests, and architectural notes."
}