{
  "backend/main.mo": "Defines the backend actor with all domain types for routines, scores, user profiles, utilities, and metrics across fasting, sleep, stress, training, and body composition.",
  "feature_evidence.json": "Lists feature evidence records linking UI/UX enhancements to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of major frontend files describing their roles, themes, and functionality across the app.",
  "frontend/index.html": "Basic HTML root document that mounts the React application and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up authentication flow, profile setup routing, legal disclaimer logic, and configures TanStack Router with global theme and layout.",
  "frontend/src/components/AutophagyScoreInfo.tsx": "Modal component that displays detailed autophagy score breakdowns with multilingual labels, icons, ranges, and progress visuals.",
  "frontend/src/components/BodyCompositionCard.tsx": "Displays body composition metrics with adjustable inputs and BMI indicators using color‑coded labels and presets.",
  "frontend/src/components/ChecklistCard.tsx": "Renders a card with a list of checklist items, each with a checkbox, label, and optional description.",
  "frontend/src/components/ChipsInput.tsx": "Provides selectable preset buttons for numeric adjustments, emitting chosen values via onSelect.",
  "frontend/src/components/ChronographDial.tsx": "Implements a canvas‑based circular dial for adjusting numeric values through drag interactions with visual gradients and ticks.",
  "frontend/src/components/DailyCoachingCard.tsx": "Shows daily coaching steps and insights with category‑colored badges and icons tailored to language preference.",
  "frontend/src/components/EnergyCapsule.tsx": "Wraps content in a visual capsule that fills based on completion percentage and optional accent mode.",
  "frontend/src/components/FastingTimer.tsx": "Displays a fasting duration selector using a chronograph dial and shows feedback text based on selected hours.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/FutureProjectionSection.tsx": "Presents three future‑projection panels (biological age, body form, energy/focus) with trend icons and multilingual text.",
  "frontend/src/components/GradientSlider.tsx": "Customizable slider with gradient background, optional scale labels, and luxury gold defaults.",
  "frontend/src/components/Header.tsx": "App header with navigation menu, token balance, settings, and logout handling.",
  "frontend/src/components/JournalCard.tsx": "Journal entry manager allowing creation, editing, deletion, and display of timestamped entries.",
  "frontend/src/components/LegalDisclaimerModal.tsx": "Modal showing a bilingual legal disclaimer with acknowledgment logic for first launch.",
  "frontend/src/components/LoginScreen.tsx": "Login page using Internet Identity with branding, description, and feature icons.",
  "frontend/src/components/NutritionCard.tsx": "Nutrition tracking card for protein, vegetables, and water with stepper and preset inputs.",
  "frontend/src/components/ProfileSetup.tsx": "React form for creating a user profile with validation and submission via saveProfile mutation.",
  "frontend/src/components/ScoreRing.tsx": "Canvas-based circular score indicator with gradient arc and optional label/value display.",
  "frontend/src/components/SettingsDialog.tsx": "Dialog for editing and saving user profile settings, prefilled from user data with form validation.",
  "frontend/src/components/SleepCard.tsx": "Card UI for tracking sleep duration and quality using stepper and dial controls with language support.",
  "frontend/src/components/SmartInsight.tsx": "Displays a small insight card with an icon and message based on insight type.",
  "frontend/src/components/SmartInsightsOverlay.tsx": "Overlay that shows temporary motivational or warning messages based on score thresholds.",
  "frontend/src/components/StepperInput.tsx": "Numeric stepper with press-and-hold acceleration for incrementing or decrementing values.",
  "frontend/src/components/StressCard.tsx": "Renders a stress tracking card with inputs for systolic, diastolic, and pulse values and computes a color-coded status indicator.",
  "frontend/src/components/SupplementCard.tsx": "Manages a list of supplement entries with add, edit, delete, and completion toggle functionality, including form handling and sorting.",
  "frontend/src/components/TokenWallet.tsx": "Displays token balance, transactions, and transfer UI, with admin functions and integrations for identity, queries, and on‑chain actions.",
  "frontend/src/components/TrainingCard.tsx": "Allows users to add, view, and manage training sessions with types, duration, and intensity, and supports saving and loading sessions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user data, routines, scores, tokens, supplements, trainings, and journal entries via an actor API. Includes extensive cache invalidation across related queries.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom theme variables for a dark luxury gold UI, plus utility classes for glass panels, shadows, gradients, and animated components.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AnalysisPage.tsx": "Displays detailed health analytics using routines and body composition data, with charts, statistics, and a reset analysis feature.",
  "frontend/src/pages/Dashboard.tsx": "Main user dashboard aggregating routines, body metrics, supplements, trainings, and coaching insights, with many interactive cards and mutation handlers.",
  "frontend/src/pages/JournalPage.tsx": "Implements a journaling interface allowing creation, editing, and deletion of journal entries with language-aware messaging.",
  "frontend/src/pages/WalletPage.tsx": "Renders the LIV token wallet page showing blockchain-based token management and ecosystem features with localized text.",
  "frontend/src/utils/dailyCoaching.ts": "Generates prioritized daily coaching steps based on user routines and scores, producing actionable guidance across sleep, hydration, fasting, training, nutrition, and stress.",
  "frontend/src/utils/dailyCoachingInsights.ts": "Creates short-form insights and warnings from current metrics and score trends, returning the top three most relevant messages.",
  "frontend/src/utils/theme.ts": "Defines gold‑jade themed gradient presets and helpers for score‑based color generation and background effects.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom gold/jade theme colors, shadows, radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including theme redesign goals, required assets, and high-level feature definitions."
}