{
  "kind": "build_request",
  "title": "Remove logo image, redirect to Dashboard after login, and fix app load crash",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Identify and fix the client-side runtime error that causes the app to render the router error fallback screen (\"Something went wrong\") on initial load, so authenticated users can reliably see the app (Dashboard and other routes) without crashing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Something went wrong\nAn unexpected error occurred while loading the application.\nPlease try reloading the page. If the problem persists, contact support."
        ]
      },
      "acceptanceCriteria": [
        "Opening the app no longer immediately shows the router-level error fallback screen during normal operation.",
        "Any remaining errors are logged to the browser console with enough detail to diagnose them, but the UI remains usable (no crash loop)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the LivSpan logo image from the UI so no image is displayed on the login screen and in the authenticated header area (e.g., remove/disable the <img> rendering that references \"/assets/MagicEraser_251230_145221.png\"), while keeping the rest of the layout visually coherent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Bitte das Bild nicht mehr einblenden"
        ]
      },
      "acceptanceCriteria": [
        "The login screen no longer renders the logo image sourced from \"/assets/MagicEraser_251230_145221.png\".",
        "The authenticated header no longer renders the logo image sourced from \"/assets/MagicEraser_251230_145221.png\".",
        "No broken-image placeholder or empty image box is visible anywhere in the UI."
      ]
    },
    {
      "id": "REQ-3",
      "text": "After a user completes authentication (Internet Identity login), always route them directly to the Dashboard route (\"/\") regardless of which route they attempted to visit while unauthenticated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "nach der Anmeldung direkt auf das Dashboard gehen"
        ]
      },
      "acceptanceCriteria": [
        "If a user opens a deep link (e.g., \"/wallet\") while logged out, they are shown the login screen; after logging in, they are redirected to \"/\" (Dashboard).",
        "If a user logs in from the login screen, the next rendered page is the Dashboard at path \"/\"."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify frontend immutable hook entrypoints: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not add new authentication providers (only Internet Identity).",
    "Do not redesign unrelated pages (Wallet/Analysis/Journal) beyond what is required to remove the image and fix the crash."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}