{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize initial load, remove logo image, and force post-login redirect to Dashboard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the initial-load client runtime error that triggers the router-level error fallback and harden error logging so the UI remains usable.",
      "acceptanceCriteria": [
        "Opening the app no longer immediately shows the router-level error fallback screen during normal operation.",
        "Any remaining errors are logged to the browser console with enough detail to diagnose them, but the UI remains usable (no crash loop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden critical React Query hooks used during app bootstrap (notably caller profile and legal disclaimer status) so they do not throw when the actor is not ready or when transient auth/initialization conditions occur; instead return safe defaults and surface errors via query state while keeping console logging for diagnostics."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update RootComponent/Layout bootstrap flow to gracefully handle query error states (log details to console and keep the UI navigable with a non-crashing fallback state), preventing router error fallback from appearing on normal initial loads for authenticated users."
        },
        {
          "path": "frontend/src/components/RouterErrorFallback.tsx",
          "operation": "modify",
          "description": "Improve router fallback diagnostics by including more resilient console logging (e.g., handle non-Error throwables safely) while keeping the fallback UI stable and non-recursive."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the LivSpan logo image from the login screen and authenticated header without leaving broken-image placeholders or layout gaps.",
      "acceptanceCriteria": [
        "The login screen no longer renders the logo image sourced from \"/assets/MagicEraser_251230_145221.png\".",
        "The authenticated header no longer renders the logo image sourced from \"/assets/MagicEraser_251230_145221.png\".",
        "No broken-image placeholder or empty image box is visible anywhere in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LoginScreen.tsx",
          "operation": "modify",
          "description": "Remove the <img> element referencing \"/assets/MagicEraser_251230_145221.png\" and adjust surrounding spacing/alignment so the login layout remains visually coherent without reserving empty image space."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove the header <img> element referencing \"/assets/MagicEraser_251230_145221.png\" and adjust the header’s left-side layout (gap/typography alignment) so no empty image box or broken-image placeholder appears."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "After successful Internet Identity authentication, always redirect users to the Dashboard route (\"/\") even if they started from a deep link.",
      "acceptanceCriteria": [
        "If a user opens a deep link (e.g., \"/wallet\") while logged out, they are shown the login screen; after logging in, they are redirected to \"/\" (Dashboard).",
        "If a user logs in from the login screen, the next rendered page is the Dashboard at path \"/\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Implement a post-auth redirect rule in RootComponent using TanStack Router navigation so that when identity becomes available (login completes), navigation is forced to \"/\" (replace history) regardless of the previously requested route, while preserving profile setup/disclaimer gating behavior."
        },
        {
          "path": "frontend/src/components/LoginScreen.tsx",
          "operation": "modify",
          "description": "Ensure the login screen relies on the centralized post-auth redirect behavior (in App bootstrap) and does not attempt to preserve or restore deep-link routing after login; keep login UX unchanged aside from the removed logo image."
        }
      ]
    }
  ]
}