{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dashboard routine input redesign (dials, steppers, chips) replacing sliders",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace slider-based routine inputs across all routine cards with modern, dashboard-matching controls while preserving numeric ranges/steps and existing state/localStorage behavior.",
      "acceptanceCriteria": [
        "Fasting, Sleep, Nutrition, Stress/Vitals, and Body Composition inputs no longer use the slider UI as the primary interaction (GradientSlider/Slider is not the main control presented to the user).",
        "All routine values (fastingHours, sleepDuration, sleepQuality, proteinIntake, veggieIntake, waterIntake, systolic, diastolic, pulse, weight, bodyFat, muscleMass) remain editable and feed into the existing calculations and Save Daily Routine flow unchanged.",
        "Existing min/max/step constraints are preserved (e.g., fasting 0–24 step 0.5; sleep duration 0–10 step 0.5; sleep quality 0–10 step 1; etc.).",
        "Routine cards still visually fit the existing luxury/glass dashboard design (no unstyled HTML inputs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FastingTimer.tsx",
          "operation": "modify",
          "description": "Replace the current GradientSlider-based fastingHours control with a modern non-slider control (dial as primary per REQ-2), preserving min/max/step (0–24, step 0.5) and keeping the same onFastingDurationChange state updates/localStorage behavior in Dashboard. Ensure any newly introduced user-facing strings are English."
        },
        {
          "path": "frontend/src/components/SleepCard.tsx",
          "operation": "modify",
          "description": "Remove GradientSlider as the primary UI for sleepDuration and sleepQuality, replacing with dashboard-styled modern alternatives (dial/stepper/chips as appropriate), preserving min/max/step (duration 0–10 step 0.5; quality 0–10 step 1) and keeping the same callback-driven state updates from Dashboard."
        },
        {
          "path": "frontend/src/components/NutritionCard.tsx",
          "operation": "modify",
          "description": "Replace GradientSlider controls for proteinIntake, veggieIntake, and waterIntake with modern controls (steppers/chips), preserving computed max values and existing steps (protein step 5; veggies step 10; water step 0.1). Use shadcn-ui primitives (e.g., Button) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StressCard.tsx",
          "operation": "modify",
          "description": "Replace GradientSlider controls for systolic, diastolic, and pulse with modern non-slider controls (e.g., steppers), preserving min/max/step (80–180 step 1; 50–120 step 1; 40–150 step 1). Ensure the status indicator behavior and displayed values remain unchanged."
        },
        {
          "path": "frontend/src/components/BodyCompositionCard.tsx",
          "operation": "modify",
          "description": "Replace GradientSlider controls for weight, bodyFat, and muscleMass with modern non-slider controls (e.g., steppers with optional quick chips), preserving min/max/step (weight 30–200 step 0.1; body fat 5–50 step 0.1; muscle mass 10–100 step 0.1). Ensure BMI display and category coloring remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Use the existing ChronographDial circular control for at least two routine inputs where it best matches the dashboard aesthetic.",
      "acceptanceCriteria": [
        "At least two routine inputs use ChronographDial as the primary control (e.g., fastingHours and sleepQuality, or pulse and sleepQuality).",
        "Dial interactions work with both mouse and touch, and values snap to the configured step (matching current slider steps).",
        "The dial control displays an English label and unit (if applicable) and visually aligns with the existing glass/luxury theme (spacing, typography, colors)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FastingTimer.tsx",
          "operation": "modify",
          "description": "Integrate the existing ChronographDial component as the primary control for fastingHours with min 0, max 24, step 0.5, an English label, and an 'h' unit. Ensure touch + mouse dragging works and value snaps correctly; visually match existing glass/luxury styling."
        },
        {
          "path": "frontend/src/components/SleepCard.tsx",
          "operation": "modify",
          "description": "Integrate the existing ChronographDial component as the primary control for sleepQuality with min 0, max 10, step 1, an English label, and '/10' or unitless display consistent with the card. Ensure touch + mouse dragging works and value snaps correctly; visually match existing glass/luxury styling."
        },
        {
          "path": "frontend/src/components/ChronographDial.tsx",
          "operation": "modify",
          "description": "Refine ChronographDial to better align with the dashboard glass/luxury theme and ensure step snapping + pointer interaction feel consistent (mouse/touch). Keep behavior compatible with current callers (no breaking prop changes unless updated across all usages)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Introduce stepper and segmented/chip-style inputs to replace sliders for remaining routine fields, selecting appropriate control types per metric.",
      "acceptanceCriteria": [
        "StressCard uses non-slider controls for systolic/diastolic/pulse (e.g., stepper +/- with direct numeric display) and still computes and displays the same status indicator behavior.",
        "NutritionCard replaces sliders with modern controls (e.g., stepper for grams/liters plus optional preset chips like common increments), while preserving current computed targets and displayed values.",
        "BodyCompositionCard replaces sliders with modern controls (e.g., steppers and/or compact dial), while BMI display and category coloring remain correct and unchanged.",
        "All newly introduced user-facing strings for these new controls are in English (do not add new German strings)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StepperInput.tsx",
          "operation": "create",
          "description": "Create a reusable StepperInput primitive for precise numeric adjustments (min/max/step, +/- buttons, optional press-and-hold acceleration, disabled states). Compose shadcn-ui components (e.g., Button) for styling and accessibility; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChipsInput.tsx",
          "operation": "create",
          "description": "Create a reusable chip/preset input primitive for common increments/presets (e.g., +0.5h, +250ml), styled to match the dashboard glass/luxury theme. Compose shadcn-ui components (e.g., Button) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StressCard.tsx",
          "operation": "modify",
          "description": "Replace the three GradientSlider controls with StepperInput-based controls (and optional quick chips), keeping the same min/max/step ranges and ensuring the existing ColorIndicator-derived status block remains unchanged."
        },
        {
          "path": "frontend/src/components/NutritionCard.tsx",
          "operation": "modify",
          "description": "Replace protein/veggie/water sliders with StepperInput + optional ChipsInput presets (e.g., common increments) while preserving current computed targets, displayed values, and step precision. Ensure any new labels/help text are English."
        },
        {
          "path": "frontend/src/components/BodyCompositionCard.tsx",
          "operation": "modify",
          "description": "Replace weight/body fat/muscle mass sliders with StepperInput (and optional ChipsInput for common deltas) while preserving min/max/step and maintaining BMI calculation display and category coloring exactly as before."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure redesigned inputs are consistent and reusable via shared UI primitives and subtle motion across routine cards without touching immutable auth-related hooks/paths.",
      "acceptanceCriteria": [
        "A small set of reusable input components (e.g., StepperInput, SegmentedControl/Chips) is used across multiple routine cards instead of duplicating ad-hoc UI per card.",
        "Value changes animate subtly (e.g., number transitions or soft highlight) and do not degrade dashboard readability or performance.",
        "No changes are made to the Internet Identity hooks or other immutable frontend paths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FastingTimer.tsx",
          "operation": "modify",
          "description": "Adopt shared input primitives/styling (where applicable) around the dial value readout (e.g., consistent label/value typography and subtle transitions) to match the rest of the redesigned routine inputs."
        },
        {
          "path": "frontend/src/components/SleepCard.tsx",
          "operation": "modify",
          "description": "Use shared StepperInput/ChipsInput primitives for non-dial fields and apply consistent motion/interaction patterns (subtle value transition/highlight) matching the dashboard theme."
        },
        {
          "path": "frontend/src/components/NutritionCard.tsx",
          "operation": "modify",
          "description": "Use shared StepperInput/ChipsInput primitives (no bespoke per-card controls) and apply consistent motion/interaction patterns and typography."
        },
        {
          "path": "frontend/src/components/StressCard.tsx",
          "operation": "modify",
          "description": "Use shared StepperInput (and optional ChipsInput) primitives and apply consistent subtle value transition/highlight while keeping the status indicator readable."
        },
        {
          "path": "frontend/src/components/BodyCompositionCard.tsx",
          "operation": "modify",
          "description": "Use shared StepperInput/ChipsInput primitives and apply consistent subtle value transition/highlight while keeping BMI visuals unchanged."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add small, reusable utility classes for subtle value-change transitions/highlights that fit the existing luxury/glass theme (avoid adding new global stylesheet files). Ensure performance-friendly animations."
        }
      ]
    }
  ]
}